DataFrame and Series:

Creation of DataFrame:

In [1]:
import pandas as pd

data = pd.DataFrame({
    "Name": ["Braund, Mr. Owen Harris",
                "Allen, Mr. William Henry",
                 "Bonnell, Miss. Elizabeth"],
    "Age": [20, 23, 45],
    "Sex": ["male", "male", "female"]
})

data

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   20    male
1  Allen, Mr. William Henry   23    male
2  Bonnell, Miss. Elizabeth   45  female

To manually store data in a table, create a DataFrame. When using a Python dictionary of lists, the dictionary keys will be used as column headers and the values in each list as rows of the DataFrame.

A DataFrame is a 2-dimensional data structure that can store data of different types (including characters, integers, floating point values, categorical data and more) in columns. It is similar to a spreadsheet, a SQL table or the data.frame in R.

Series:
 Each column in a dataframe is a series.

In [2]:
data["Age"]

0    20
1    23
2    45
Name: Age, dtype: int64

When selecting a single column of a pandas DataFrame, the result is a pandas Series. To select the column, use the column label in between square brackets [].

In [8]:
ages = pd.Series([22, 23, 45], name="Age")
ages

0    22
1    23
2    45
Name: Age, dtype: int64

This is how we craete a series from scratch.

In [6]:
data["Age"].max()

45

In [9]:
ages.max()

45

In [10]:
data.describe() # Gives the statistical overview of a dataset

             Age
count   3.000000
mean   29.333333
std    13.650397
min    20.000000
25%    21.500000
50%    23.000000
75%    34.000000
max    45.000000